openwch/ch32v307/EVT/EXAM/USB/USBHS/HOST/User/ch32v30x_usbhs_host.h
#define USBHD_UEP2_3_MOD       (*((PUINT8V)(0x5000000d)))  // endpoint 2/3 mode
#define     USBHD_UEP3_RX_EN       0x80      // enable USB endpoint 3 receiving (OUT)
#define     USBHD_UEP3_TX_EN       0x40      // enable USB endpoint 3 transmittal (IN)
#define     USBHD_UEP3_BUF_MOD     0x10      // buffer mode of USB endpoint 3
#define     USBHD_UEP2_RX_EN       0x08      // enable USB endpoint 2 receiving (OUT)
#define     USBHD_UEP2_TX_EN       0x04      // enable USB endpoint 2 transmittal (IN)
#define     USBHD_UEP2_BUF_MOD     0x01      // buffer mode of USB endpoint 2

//#define R8_UH_EP_MOD        USBHD_UEP2_3_MOD               //host endpoint mode
#define USBHD_UH_EP_MOD     USBHD_UEP2_3_MOD
#define     USBHD_UH_EP_TX_EN      0x40      // enable USB host OUT endpoint transmittal
#define     USBHD_UH_EP_TBUF_MOD   0x10      // buffer mode of USB host OUT endpoint
// bUH_EP_TX_EN & bUH_EP_TBUF_MOD: USB host OUT endpoint buffer mode, buffer start address is UH_TX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for transmittal (OUT endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_T_TOG selection for transmittal (OUT endpoint), total=128bytes
#define     USBHD_UH_EP_RX_EN      0x08      // enable USB host IN endpoint receiving
#define     USBHD_UH_EP_RBUF_MOD   0x01      // buffer mode of USB host IN endpoint
// bUH_EP_RX_EN & bUH_EP_RBUF_MOD: USB host IN endpoint buffer mode, buffer start address is UH_RX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for receiving (IN endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_R_TOG selection for receiving (IN endpoint), total=128bytes

#define USBHD_UEP5_6_MOD       (*((PUINT8V)(0x5000000e)))  // endpoint 5/6 mode
#define USBHD_UEP6_RX_EN       0x80      // enable USB endpoint 6 receiving (OUT)
#define USBHD_UEP6_TX_EN       0x40      // enable USB endpoint 6 transmittal (IN)
#define USBHD_UEP6_BUF_MOD     0x10      // buffer mode of USB endpoint 6
#define USBHD_UEP5_RX_EN       0x08      // enable USB endpoint 5 receiving (OUT)
#define USBHD_UEP5_TX_EN       0x04      // enable USB endpoint 5 transmittal (IN)
#define USBHD_UEP5_BUF_MOD     0x01      // buffer mode of USB endpoint 5

#define USBHD_UEP7_MOD         (*((PUINT8V)(0x5000000f)))  // endpoint 7 mode
#define USBHD_UEP7_RX_EN       0x08      // enable USB endpoint 7 receiving (OUT)
#define USBHD_UEP7_TX_EN       0x04      // enable USB endpoint 7 transmittal (IN)
#define USBHD_UEP7_BUF_MOD     0x01      // buffer mode of USB endpoint 7


#define USBHD_UEP0_DMA        (*((PUINT32V)(0x50000010))) // endpoint 0 DMA buffer address
#define USBHD_UEP1_DMA        (*((PUINT32V)(0x50000014))) // endpoint 1 DMA buffer address
#define USBHD_UEP2_DMA        (*((PUINT32V)(0x50000018))) // endpoint 2 DMA buffer address
#define USBHD_UH_RX_DMA       USBHD_UEP2_DMA                // host rx endpoint buffer high address
#define USBHD_UEP3_DMA        (*((PUINT32V)(0x5000001c))) // endpoint 3 DMA buffer address

#define USBHD_UEP4_DMA        (*((PUINT32V)(0x50000020))) // endpoint 4 DMA buffer address
#define USBHD_UEP5_DMA        (*((PUINT32V)(0x50000024))) // endpoint 5 DMA buffer address
#define USBHD_UEP6_DMA        (*((PUINT32V)(0x50000028))) // endpoint 6 DMA buffer address
#define USBHD_UEP7_DMA        (*((PUINT32V)(0x5000002c))) // endpoint 7 DMA buffer address

#define USBHD_UH_TX_DMA         USBHD_UEP3_DMA    // host tx endpoint buffer high address
#define USBHD_UEP0_T_LEN       (*((PUINT8V)(0x50000030)))  // endpoint 0 transmittal length
#define USBHD_UEP0_TX_CTRL     (*((PUINT8V)(0x50000032)))  // endpoint 0 control
#define USBHD_UEP0_RX_CTRL     (*((PUINT8V)(0x50000033)))  // endpoint 0 control
#define USBHD_UEP1_T_LEN       (*((PUINT8V)(0x50000034)))  // endpoint 1 transmittal length
#define USBHD_UEP1_TX_CTRL     (*((PUINT8V)(0x50000036)))  // endpoint 1 control
#define USBHD_UEP1_RX_CTRL     (*((PUINT8V)(0x50000037)))  // endpoint 1 control

#define USBHD_UEP_AUTO_TOG     0x08      // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define USBHD_UEP_R_TOG        0x04      // expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1
#define USBHD_UEP_T_TOG        0x04      // prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1

#define USBHD_UEP_R_RES1       0x02      // handshake response type high bit for USB endpoint X receiving (OUT)
#define USBHD_UEP_R_RES0       0x01      // handshake response type low bit for USB endpoint X receiving (OUT)
#define USBHD_UEP_R_RES_MASK      0x03      // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define USBHD_UEP_R_RES_ACK       0x00
#define USBHD_UEP_R_RES_TOUT      0x01
#define USBHD_UEP_R_RES_NAK       0x02
#define USBHD_UEP_R_RES_STALL     0x03
// RB_UEP_R_RES1 & RB_UEP_R_RES0: handshake response type for USB endpoint X receiving (OUT)
//   00: ACK (ready)
//   01: no response, time out to host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
#define USBHD__UEP_T_RES1         0x02      // handshake response type high bit for USB endpoint X transmittal (IN)
#define USBHD__UEP_T_RES0         0x01      // handshake response type low bit for USB endpoint X transmittal (IN)
#define USBHD_UEP_T_RES_MASK      0x03      // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define USBHD_UEP_T_RES_ACK       0x00
#define USBHD_UEP_T_RES_TOUT      0x01
#define USBHD_UEP_T_RES_NAK       0x02
#define USBHD_UEP_T_RES_STALL     0x03
// bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X transmittal (IN)
//   00: DATA0 or DATA1 then expecting ACK (ready)
//   01: DATA0 or DATA1 then expecting no response, time out from host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
              // host aux setup
#define USBHD_UH_SETUP      USBHD_UEP1_TX_CTRL
#define USBHD_UH_PRE_PID_EN    0x0400      // USB host PRE PID enable for low speed device via hub
#define USBHD_UH_SOF_EN        0x04        // USB host automatic SOF enable


#define USBHD_UEP2_T_LEN       (*((PUINT8V)(0x50000038)))  // endpoint 2 transmittal length
#define USBHD_UEP2_TX_CTRL     (*((PUINT8V)(0x5000003a)))  // endpoint 2 tx control
#define USBHD_UEP2_RX_CTRL     (*((PUINT8V)(0x5000003b)))  // endpoint 2 rx control
              // host endpoint and PID
#define USBHD_UH_EP_PID     USBHD_UEP2_T_LEN
#define USBHD_UH_TOKEN_MASK       0xF0      // bit mask of token PID for USB host transfer
#define USBHD_UH_ENDP_MASK        0x0F      // bit mask of endpoint number for USB host transfer

#define USBHD_UH_RX_CTRL    USBHD_UEP2_RX_CTRL  // host receiver endpoint control
#define USBHD_UH_R_AUTO_TOG    0x08      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define USBHD_UH_R_TOG         0x04      // expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1
#define USBHD_UH_R_RES         0x01      // prepared handshake response type for host receiving (IN): 0=ACK (ready), 1=no response, time out to device, for isochronous transactions


#define USBHD_UEP3_T_LEN       (*((PUINT16V)(0x5000003c))) // endpoint 3 transmittal length
#define USBHD_UEP3_TX_CTRL     (*((PUINT8V)(0x5000003e)))  // endpoint 3 tx control
#define USBHD_UEP3_RX_CTRL     (*((PUINT8V)(0x5000003f)))  // endpoint 3 rx control

#define USBHD_UH_TX_LEN     USBHD_UEP3_T_LEN

#define USBHD_UH_TX_CTRL       USBHD_UEP3_TX_CTRL      // host transmittal endpoint control
#define USBHD_UH_T_AUTO_TOG    0x08                    // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define USBHD_UH_T_TOG         0x04                    // prepared data toggle flag of host transmittal (SETUP/OUT): 0=DATA0, 1=DATA1
#define USBHD_UH_T_RES         0x01                    // expected handshake response type for host transmittal (SETUP/OUT): 0=ACK (ready), 1=no response, time out from device, for isochronous transactions


#define USBHD_UEP4_T_LEN       (*((PUINT8V)(0x50000040)))  // endpoint 4 transmittal length
#define USBHD_UEP4_TX_CTRL     (*((PUINT8V)(0x50000042)))  // endpoint 4 tx control
#define USBHD_UEP4_RX_CTRL     (*((PUINT8V)(0x50000043)))  // endpoint 4 rx control


