openwch/ch32v307/EVT/EXAM/USB/USBHS/HOST/User/ch32v30x_usbhs_host.h
#define USBHD_UEP5_T_LEN       (*((PUINT8V)(0x50000044)))  // endpoint 5 transmittal length
#define USBHD_UEP5_TX_CTRL     (*((PUINT8V)(0x50000046)))  // endpoint 5 tx control
#define USBHD_UEP5_RX_CTRL     (*((PUINT8V)(0x50000047)))  // endpoint 5 rx control

#define USBHD_UEP6_T_LEN       (*((PUINT8V)(0x50000048)))  // endpoint 6 transmittal length
#define USBHD_UEP6_TX_CTRL     (*((PUINT8V)(0x5000004a)))  // endpoint 6 tx control
#define USBHD_UEP6_RX_CTRL     (*((PUINT8V)(0x5000004b)))  // endpoint 6 rx control


#define USBHD_UEP7_T_LEN       (*((PUINT8V)(0x5000004c)))  // endpoint 7 transmittal length
#define USBHD_UEP7_TX_CTRL     (*((PUINT8V)(0x5000004e)))  // endpoint 7 tx control
#define USBHD_UEP7_RX_CTRL     (*((PUINT8V)(0x5000004f)))  // endpoint 7 rx control



#define  USB_OTG_CR           (*((PUINT32V)(0x50000054)))  // usb otg control
#define     USB_OTG_CR_SESS           0x20               // usb otg control,会话电平使能
#define     USB_OTG_CR_VBUS           0x10               // usb otg control,VBUS电平使能
#define     USB_OTG_CR_OTG_EN         0x08               // usb otg control,OTG功能使能
#define     USB_OTG_CR_IDPU           0x04               // usb otg control,ID引脚上拉
#define     USB_OTG_CR_CHARGEVBUS     0x02               // usb otg control,VBUS充电
#define     USB_OTG_CR_DISCHARGEVBUS  0x01               // usb otg control,VBUS放电

#define  USB_OTG_SR          (*((PUINT32V)(0x50000058)))  // usb otg status
#define     USB_OTG_SR_VBUS_VLD       0x01               // usb otg status,A设备VBUS输入电平有效
#define     USB_OTG_SR_SESS_VLD       0x02               // usb otg status,会话有效电平有效标志
#define     USB_OTG_SR_SESS_END       0x04               // usb otg status,会话结束电平有效标志
#define     USB_OTG_SR_ID_DIG         0x08               // usb otg status,ID电平

#endif
/* USBHS PHY Clock Config (RCC_CFGR2) 使用USBHS PHY时钟的情况下，需要用到这些宏定义 */
#ifndef  USBHS_EXIST
#define USB_48M_CLK_SRC_MASK   (1<<31)
#define USB_48M_CLK_SRC_SYS    (0<<31)
#define USB_48M_CLK_SRC_PHY    (1<<31)

#define USBHS_PLL_ALIVE        (1<<30)

#define USBHS_PLL_CKREF_MASK   (3<<28)
#define USBHS_PLL_CKREF_3M     (0<<28)
#define USBHS_PLL_CKREF_4M     (1<<28)
#define USBHS_PLL_CKREF_8M     (2<<28)
#define USBHS_PLL_CKREF_5M     (3<<28)

#define USBHS_PLL_SRC_MASK     (1<<27)
#define USBHS_PLL_SRC_HSE      (0<<27)
#define USBHS_PLL_SRC_HSI      (1<<27)

#define USBHS_PLL_SRC_PRE_MASK (7<<24)
#define USBHS_PLL_SRC_PRE_DIV1 (0<<24)
#define USBHS_PLL_SRC_PRE_DIV2 (1<<24)
#define USBHS_PLL_SRC_PRE_DIV3 (2<<24)
#define USBHS_PLL_SRC_PRE_DIV4 (3<<24)
#define USBHS_PLL_SRC_PRE_DIV5 (4<<24)
#define USBHS_PLL_SRC_PRE_DIV6 (5<<24)
#define USBHS_PLL_SRC_PRE_DIV7 (6<<24)


 /*******************RCC_CFG2***********************/
 #define USBHS_CLK_SRC_PHY     (1<<31)
 #define USBHS_CLK_SRC_SYS     (0<<31)
 #define USBHS_PLLALIVE        (1<<30)

 #define USBHS_PLL_CKREF_3M    (0<<28)
 #define USBHS_PLL_CKREF_4M    (1<<28)
 #define USBHS_PLL_CKREF_8M    (2<<28)
 #define USBHS_PLL_CKREF_5M    (3<<28)

 #define USBHS_PLL_SRC_HSE      (0<<27)
 #define USBHS_PLL_SRC_HSI      (1<<27)

 #define USBHS_PLL_SRC_PRE_DIV1 (0<<24)
 #define USBHS_PLL_SRC_PRE_DIV2 (1<<24)
 #define USBHS_PLL_SRC_PRE_DIV3 (2<<24)
 #define USBHS_PLL_SRC_PRE_DIV4 (3<<24)
 #define USBHS_PLL_SRC_PRE_DIV5 (4<<24)
 #define USBHS_PLL_SRC_PRE_DIV6 (5<<24)
 #define USBHS_PLL_SRC_PRE_DIV7 (6<<24)
 #define USBHS_PLL_SRC_PRE_DIV8 (7<<24)
 /*******************RCC_AHBEBR***********************/
 #define USBHS_CLK_EN        (1<<11)


/******************************************************************************/
/*                         USB HD Host Mode Peripheral Register map                              */
/******************************************************************************/
 /********************************************/
 // R8_USB_CTRL
 #define DMA_EN                  (1<<0)
 #define USB_ALL_CLR             (1<<1)
 #define USB_FORCE_RST           (1<<2)
 #define INT_BUSY_EN             (1<<3)
 #define DEV_PU_EN               (1<<4)
 #define FULL_SPEED              (0<<5)
 #define HIGH_SPEED              (1<<5)
 #define LOW_SPEED               (2<<5)
 #define HOST_MODE               (1<<7)

//R8_UHOST_CTRL
 #define SEND_BUS_RESET          (1<<0)
 #define SEND_BUS_SUSPEND        (1<<1)
 #define SEND_BUS_RESUME         (1<<2)
 #define REMOTE_WAKE             (1<<3)
 #define PHY_SUSPENDM            (1<<4)
 #define UH_SOFT_FREE            (1<<6)
 #define SEND_SOF_EN             (1<<7)

// R8_USB_INT_EN
#define USBHS_DETECT_EN          (1<<0)
#define USBHS_ACT_EN             (1<<1)
#define USBHS_SUSP_EN            (1<<2)
#define USBHS_SOF_EN             (1<<3)
#define USBHS_OVER_EN            (1<<4)
#define USBHS_SETUP_EN           (1<<5)
#define USBHS_ISO_EN             (1<<6)
#define USBHS_DEV_NAK_EN         (1<<7)

// USB SUSPENED
#define HOST_TESTMODE_MASK       (3<<0)
#define DEV_REMOTE_WAKEUP        (1<<2)
#define USB_LINESTATE            (3<<4)

// R8_USB_SPEED_TYPE
#define USBSPEED_MASK            (0x03)

// R8_USB_MIS_ST
#define USBHS_SPLIT_CAN          (1<<0)
#define USBHS_ATTCH              (1<<1)
#define USBHS_SUSPEND            (1<<2)
#define USBHS_BUS_RESET          (1<<3)
#define USBHS_FIFO_RDY           (1<<4)
#define USBHS_SIE_FREE           (1<<5)
#define USBHS_SOF_ACT            (1<<6)
#define USBHS_SOF_PRES           (1<<7)

// R8_USB_INT_FLAG
#define USBHS_DETECT_FLAG        (1<<0)
#define USBHS_ACT_FLAG           (1<<1)
#define USBHS_SUSP_FLAG          (1<<2)
#define USBHS_SOF_FLAG           (1<<3)
#define USBHS_OVER_FLAG          (1<<4)
#define USBHS_SETUP_FLAG         (1<<5)
#define USBHS_ISO_FLAG           (1<<6)

// R8_USUB_INT_ST
#define USBHS_TOGGLE_OK          (0x40)
#define USBHS_HOST_RES           (0x0f)

// R32_UH_EP_MOD
 #define HOST_TX_EN           (1<<3)
 #define HOST_RX_EN           (1<<18)

// HOST_EP_TYPE
#define USBHS_ENDP_TX_ISO     (1<<3)
#define USBHS_ENDP_RX_ISO     (1<<(16+2))

// R32_UH_EP_PID
 #define HOST_MASK_TOKEN      (0x0f)
 #define HOST_MASK_ENDP       (0x0f<<4)

//R8_UH_RX_CTRL
 #define EP_R_RES_MASK        (3<<0)
 #define EP_R_RES_ACK         (0<<0)
 #define EP_R_RES_NYET        (1<<0)
 #define EP_R_RES_NAK         (2<<0)
 #define EP_R_RES_STALL       (3<<0)

 #define UH_R_RES_NO          (1<<2)
 #define UH_R_TOG_1           (1<<3)
 #define UH_R_TOG_2           (2<<3)
 #define UH_R_TOG_3           (3<<3)
 #define UH_R_TOG_AUTO        (1<<5)
 #define UH_R_DATA_NO         (1<<6)
//R8_UH_TX_CTRL
 #define UH_T_RES_MASK        (3<<0)
 #define UH_T_RES_ACK         (0<<0)
 #define UH_T_RES_NYET        (1<<0)
 #define UH_T_RES_NAK         (2<<0)
 #define UH_T_RES_STALL       (3<<0)

 #define UH_T_RES_NO          (1<<2)
 #define UH_T_TOG_1           (1<<3)
 #define UH_T_TOG_2           (2<<3)
 #define UH_T_TOG_3           (3<<3)
 #define UH_T_TOG_AUTO        (1<<5)
 #define UH_T_DATA_NO         (1<<6)


#define DEV_TYPE_KEYBOARD     (USB_DEV_CLASS_HID | 0x20)
#define DEV_TYPE_MOUSE        (USB_DEV_CLASS_HID | 0x30)
#define DEF_AOA_DEVICE        0xF0
#define DEV_TYPE_UNKNOW       0xFF
/******************************************************/
 //endpoint
#define DEF_ENDP_0     0
#define DEF_ENDP_1     1
#define DEF_ENDP_2     2
#define DEF_ENDP_3     3
#define DEF_ENDP_4     4
#define DEF_ENDP_5     5
#define DEF_ENDP_6     6
#define DEF_ENDP_7     7
#define DEF_ENDP_8     8
#define DEF_ENDP_9     9
#define DEF_ENDP_10    10
#define DEF_ENDP_11    11
#define DEF_ENDP_12    12
#define DEF_ENDP_13    13
#define DEF_ENDP_14    14
#define DEF_ENDP_15    15

