openwch/ch32v307/EVT/EXAM/USB/USBHS/HOST/User/ch32v30x_usbhs_host.h
#define USBHS_MAX_PACK_SIZE     512
#define WAIT_TIME               1000000
#define WAIT_USB_TOUT_200US     3000

#ifndef ERR_SUCCESS
#define ERR_SUCCESS           (0x00)
#define ERR_USB_CONNECT       (0x15)
#define ERR_USB_DISCON        (0x16)
#define ERR_USB_BUF_OVER      (0x17)
#define ERR_USB_DISK_ERR      (0x1F)
#define ERR_USB_TRANSFER      (0x20)
#define ERR_USB_UNSUPPORT     (0xFB)
#define ERR_USB_UNKNOWN       (0xFE)
#define ERR_AOA_PROTOCOL      (0x41)
#endif

typedef struct
{
    UINT16  OutEndpMaxSize;
    UINT16  InEndpMaxSize;          // IN  端点最大包大小
    UINT8   InEndpNum;              // IN  端点号
    UINT8   Intog;                  // IN  端点同步标志位
    UINT8   InEndpCount;            // IN  端点数量
    UINT8   OutEndpNum;             // OUT 端点号
    UINT8   Outtog;                 // OUT 端点同步标志位
    UINT8   OutEndpCount;           // OUT 端点数量
}DEVENDP;

typedef struct  __attribute__((packed))  _DEV_INFO
{
     DEVENDP DevEndp;
     UINT8   DeviceStatus;           // 设备状态,0-无设备,1-有设备但尚未初始化,2-有设备但初始化枚举失败,3-有设备且初始化枚举成功
     UINT8   DeviceAddress;          // 设备被分配的USB地址
     UINT8   DeviceSpeed;            // 0为全速,1为高速，2为低速
     UINT8   DeviceType;             // 设备类型：08-磁盘   0x30-HID  0x31-KEYBOARD  0x32-MOUSE
     UINT8   DeviceEndp0Size;        // USB0设备的端点0的最大包尺寸
     UINT8   DeviceCongValue;        // 设备配置值
 }USBDEV_INFO,*pUSBDEV_INFO;

/*****************************变量外扩****************************/


 extern UINT8   FoundNewDev;
 extern UINT8   DevEnum;
 extern UINT8   Endp0MaxSize ;
 extern UINT8   UsbDevEndp0Size;
 extern __attribute__ ((aligned(4))) UINT8   endpTxBuf[  ];  // OUT, must even address
 extern __attribute__ ((aligned(4))) UINT8   endpRxBuf[  ];  // OUT, must even address

 #define pSetupReq       ((PUSB_SETUP_REQ)endpTXbuf)
 #define USB_HIGH_SPEED   1

 extern const UINT8 GetDevDescrptor[];     //get device descriptor
 extern const UINT8 GetConfigDescrptor[];  //get configuration descriptor
 extern const UINT8 SetAddress[];          //set address of device
 extern const UINT8 SetConfig[];           //set configuration of device
 extern const UINT8 Clear_EndpStall[];     //clear stall

 extern __attribute__ ((aligned(4))) UINT8   endpTXbuf[ MAX_PACKET_SIZE ];  // OUT, must even address
 extern __attribute__ ((aligned(4))) UINT8   endpRXbuf[ MAX_PACKET_SIZE ];  // OUT, must even addres
 /*****************************函数外扩****************************/
 void   CopySetupReqPkg( const UINT8 *pReqPkt );
 void   USB20_RCC_Init( void );
 void   USBHS_HostInit (FunctionalState sta);
 void   USBHS_CurrentAddr( UINT8 address );
 void   Analysis_Descr(pUSBDEV_INFO pusbdev,PUINT8 pdesc, UINT16 l);
 void   SetBusReset(void);

 UINT8  USBHS_HostEnum( UINT8 *Databuf );
 UINT8  CtrlGetDevDescr(UINT8 *Databuf);
 UINT8  CtrlGetConfigDescr(UINT8 *Databuf);
 UINT8  CtrlSetAddress(UINT8 addr);
 UINT8  CtrlSetUsbConfig(UINT8 cfg_val);
 UINT8  CtrlClearEndpStall( UINT8 endp );
 UINT8  CtrlSetUsbIntercace( UINT8 cfg );
 UINT8  HubGetPortStatus( UINT8 HubPortIndex );
 UINT8  HubSetPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt );
 UINT8  HubClearPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt );
 UINT8  HostCtrlTransfer(PUINT8 databuf,PUINT8 len);
 UINT8  USBHostTransact(UINT8 endp_pid,UINT8 toggle,UINT32 timeout);
#ifdef __cplusplus
}
#endif


#endif  


#endif
